
from gemini2 import gemini

# message = df_cleaned['message'].iloc[0]
# result = gemini(message)
# print(result)


message = """
СДУға жақын жерде орналасқан коттедж жалға беріледі. 6 орын ұлдарға,1 орын қыздарға бос.Барлық жағдай жасалынған вайпай бар жәнеде кухня отдельно тефаль,печка,микробальновка ,посуда бәрі бар. Жәнеде стиралка утюг бар,теннисный стол бар арасында ойнап сергіп алуға.Үй видео камерамен жабдықталған вайпай бар.Толықтай ақпарат білгіңіз келсе осы нөмірге хабарласыңыз:87073329414 Almaty
"""

# Call the gemini function
# print(message)
result = gemini(message)
print(result)