regions = [
    {"name": "Алматы", "districts": [" ", "Алмалинский", "Ауэзовский", "Бостандыкский", "Медеуский", "Наурызбайский", "Турксибский", "Жетысуский"]},
    {"name": "Астана", "districts": ["Алматы", "Байконур", "Есиль", "Сарыарка"]},
    {"name": "Атырау", "districts": ["Жылыойский район", "Индерский район", "Исатайский район", "Кзылкогинский район", "Курмангазинский район", "Макатский район", "Махамбетский район", "город Атырау"]},
    {"name": "Орал", "districts": ["Акжаикский район", "Бокейординский район", "Бурлинский район", "Жангалинский район", "Жанибекский район", "Байтерекский район", "Казталовский район", "Каратобинский район", "Сырымский район", "Таскалинский район", "Теректинский район", "Чингирлауский район", "город Уральск"]},
    {"name": "Шымкент", "districts": ["Абайский", "Аль-Фарабийский", "Енбекшинский", "Каратауский", "Туранский"]},
    {"name": "Талдыкорган", "districts": ["Жетысуская область"]},  # Assuming a placeholder district set
    {"name": "Тараз", "districts": ["Байзакский район", "Жамбылский район", "Жуалынский район", "Кордайский район", "Меркенский район", "Мойынкумский район", "Район имени Т. Рыскулова", "Сарысуский район", "Таласский район", "Шуский район", "город Тараз"]}
]

# Convert list of dictionaries into a more accessible dictionary
region_dict = {region['name']: region['districts'] for region in regions}


